<template>
    <el-row>
        <el-col :span="24" style="border-left:1px solid #3399ff;">
            <div class="right" v-for="(item,index) in boxData" :keys="item.id">
                <div class="border-box">
                    <span class="circle">{{item.id}}</span>
                </div>
                <div class="border-right">
                    <h3 v-html="item.name" class='seo' @dblclick="look(index,null,'fa')"></h3>
                    <p class="off">
                        {{item.date}} 距离上个进程{{item.interval}}天
                    </p>
                    <div class="children" v-if="flag[index].fa==1">
                        <!--链接-->
                        <p class="small">
                            <a :href="item.href" v-html="item.title" target="_blank" ></a>
                        </p>
                        <!--正文-->
                        <div class="contentText" v-if="item.textArry.length>0" v-for="(org,idx) in item.textArry" keys="org.id">
                            <p class="text" v-if="flag[index].ch[idx]==1">
                                {{org.text}}
                                <span class='text-child' title="查看全部" @click="look(index,idx,'ch')">
                                    点击收起<i class="el-icon-more"></i>
                                </span>
                            </p>
                            <p class="text-lend" v-else>
                                {{org.text}}
                                <span class='text-child' title="查看全部" @click="look(index,idx,'ch')">
                                    点击展开<i class="el-icon-more"></i>
                                </span>
                            </p>
                        </div>
                        
                        <!-- 跳转按钮 -->
                        <a :href="item.href" target="_blank" class="off href">点击查看更多公告</a>
                    </div>
                    
                </div>
            </div>
            <div class="math" style="visibility:hidden;white-space:nowrap;float:left;">1</div>
        </el-col>
    </el-row>
    
</template>
<script>
    export default {
        name:'rightModule',
        data(){
            return {
                boxData:[],
                boxWidth:0,
                flag:[],
            }
        },
        methods:{
            look(idx,childIdx,who){
                if(childIdx==null){
                    if(this.flag[idx][who]!=1){
                        this.flag[idx][who] = 1
                        //this.$set(this.flag, idx, 1);
                    }else{
                        this.flag[idx][who] = 0
                        //this.$set(this.flag, idx, 0);
                    }
                }else{
                    if(this.flag[idx][who][childIdx]!=1){
                        this.$set(this.flag[idx][who],childIdx,1)
                    }else{
                        this.$set(this.flag[idx][who],childIdx,0)
                    }
                }
                
            }
        },
        mounted(){
            console.log(document.querySelector('.math').parentNode.offsetWidth)
            this.boxWidth = document.querySelector('.math').parentNode.offsetWidth;
            this.boxData = [
                {
                    id:'1',
                    name:'重大资产重组停牌',
                    date:'2018-05-07',
                    interval:5,
                    title:'天泽信息(300209)发行股份及支付现金购买',
                    text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简',
                    textArry:[
                        {
                            id:123123,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        {
                            id:45,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        {
                            id:12311,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                    ],
                    href:'http://www.baidu.com'
                },
                {
                    id:'2',
                    name:'重大资产重组停牌',
                    date:'2018-05-07',
                    interval:5,
                    title:'天泽信息(300209)发行股份及支付现金购买',
                    text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简',
                    textArry:[
                        {
                            id:33,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        
                    ],
                    href:'http://www.baidu.com'
                },
                {
                    id:'3',
                    name:'重大资产重组停牌',
                    date:'2018-05-07',
                    interval:5,
                    title:'天泽信息(300209)发行股份及支付现金购买',
                    text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简',
                    textArry:[
                        {
                            id:123,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        {
                            id:123123,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        {
                            id:123123,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        {
                            id:23,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                        {
                            id:8989,
                            text:'公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简公告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简述公告简'
                        },
                    ],
                    href:'http://www.baidu.com'
                },
            ]
            var $this = this;
            this.boxData.map((obj,idx)=>{
                if(obj){
                    $this.flag.push({fa:0,ch:[]})
                    $this.flag[idx].fa = 0;
                    if(obj instanceof Array){
                        obj.map((o,i)=>{
                            var arr = $this.flag[idx].ch;
                            arr[i] = 0;
                        })
                    }
                }
            })
        },
        computed:{
        },
        watch:{
        }
    }
</script>
<style scoped>
    .right{
        width:100%;
        float:left;
    }
    .border-box{
        /* height:200px; */
        
        width:20px;
        float:left;
    }
    .border-right{
        /* height:200px; */
        float:left;
        width: calc(100% - 20px);
    }
    .circle{
        background:#3399ff;
        display:block;
        width:20px;
        height:20px;
        line-height:20px;
        text-align: center;
        border-radius:50%;
        color:#fff;
        font-size:12px;
        position:relative;
        left:-10px;
    }
    .text{
        width:100%;
        position:relative;
        font-size:14px;
        /* line-height:1.4em;
        height:2.8em; */
        /* overflow:hidden;  */

    }
    .text-lend{
        width:100%;
        position:relative;
        line-height:1.4em;
        height:2.8em;
        overflow:hidden; 
        font-size:14px;
    }
    .text-lend:after{
        content:"...";
        position:absolute;
        bottom:0;
        right:0;
        background:#FFF;
        padding-left:0.2em;
    }
    .text-lend>.text-child,.text>.text-child{
        position:absolute;
        right:20px;
        bottom:0;
        background:rgba(0,0,0,0.35);
        color:#fff;
        border:1px solid #ccc;
        width:100%;
        height:100%;
        text-align: center;
        line-height:2.8em;
        cursor: pointer;
        display:none;
    }
    .text-lend:hover .text-child,.text:hover .text-child{
        display:block;
    }
    .seo{
        font-weight:400;
        cursor: pointer;
        font-size: 16px;
        margin:8px 0;
    }
    .off{
        font-size:12px;
        color:#b9b7b7;
    }
    .children>.small{
        color:#3399ff;
        text-decoration: underline;
        font-size:14px;
    }
    .right p{
        margin:8px 0;
    }
    .href:hover{
        text-decoration: underline;
    }
</style>

